InformationRegisters/СведенияОбИнвалидностиФизлиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>СведенияОбИнвалидностиФизлиц</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОтношениеКИнвалидности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОтношениеКИнвалидности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>СерияСправки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСправки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаИнвалидности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДействияСправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Физлицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СведенияОбИнвалидностиФизлиц/Forms/УправляемаяФормаЗаписиДополнительная/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ФизЛицоПриОткрытии           	  = РегистрСведенийМенеджерЗаписи.ФизЛицо;
	ПериодПриОткрытии            	  = РегистрСведенийМенеджерЗаписи.Период;
	ГруппаИнвалидностиПриОткрытии	  = РегистрСведенийМенеджерЗаписи.ГруппаИнвалидности;
	ДатаВыдачиПриОткрытии 		   	  = РегистрСведенийМенеджерЗаписи.ДатаВыдачи;
	ОтношениеКИнвалидностиПриОткрытии = РегистрСведенийМенеджерЗаписи.ОтношениеКИнвалидности;
	НомерСправкиПриОткрытии		 	  = РегистрСведенийМенеджерЗаписи.НомерСправки;
	СерияСправкиПриОткрытии      	  = РегистрСведенийМенеджерЗаписи.СерияСправки;
	СрокДействияСправкиПриОткрытии	  = РегистрСведенийМенеджерЗаписи.СрокДействияСправки;
	Заголовок = Заголовок + " " + РегистрСведенийМенеджерЗаписи.ФизЛицо;
	
	ЭтаФорма.Прочитать();
	
	// У записи обязательно должны быть заполнены реквизиты ФизЛицо и Период
	Если РегистрСведенийМенеджерЗаписи.ФизЛицо.Пустая() Тогда
	    РегистрСведенийМенеджерЗаписи.ФизЛицо = ФизЛицоПриОткрытии;
		РегистрСведенийМенеджерЗаписи.Период  = ПериодПриОткрытии;
		// выставим по умолчанию
		РегистрСведенийМенеджерЗаписи.ГруппаИнвалидности = "III";
		//РегистрСведенийМенеджерЗаписи.Инвалидность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	// жестко установим физлицо
	РегистрСведенийМенеджерЗаписи.ФизЛицо = ФизЛицоПриОткрытии;

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ОбновитьФорму", Новый Структура("ИмяЭлемента","Инвалидность"), ФизЛицоПриОткрытии);
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	Оповестить("ОбновитьФорму", Новый Структура("ИмяЭлемента","Инвалидность"), ФизЛицоПриОткрытии);
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура КнопкаИсторияНажатие(Элемент)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ФизЛицоСсылка", РегистрСведенийМенеджерЗаписи.ФизЛицо);
	ОткрытьФорму("РегистрСведений.СведенияОбИнвалидностиФизлиц.ФормаСписка",ПараметрыФормы);
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если НЕ ЗначениеЗаполнено(РегистрСведенийМенеджерЗаписи.ОтношениеКИнвалидности) Тогда // очистили инвалидность - удалим запись
		МенеджерЗаписи = РегистрыСведений.СведенияОбИнвалидностиФизлиц.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Период   = ПериодПриОткрытии;
		МенеджерЗаписи.ФизЛицо  = ФизЛицоПриОткрытии;
		МенеджерЗаписи.ГруппаИнвалидности	  = ГруппаИнвалидностиПриОткрытии;
		МенеджерЗаписи.ДатаВыдачи	     	  = ДатаВыдачиПриОткрытии;
		МенеджерЗаписи.НомерСправки     	  = НомерСправкиПриОткрытии;
		МенеджерЗаписи.СерияСправки	     	  = СерияСправкиПриОткрытии;
		МенеджерЗаписи.СрокДействияСправки	  = СрокДействияСправкиПриОткрытии;
		МенеджерЗаписи.Удалить();
		
		//РегистрСведенийМенеджерЗаписи.Удалить();

	// Если поменяли дату, то тогда новая  запись
	ИначеЕсли ПериодПриОткрытии <> РегистрСведенийМенеджерЗаписи.Период Тогда
		
		// Если что-то поменяли тогда запишем 
		Если ГруппаИнвалидностиПриОткрытии <> РегистрСведенийМенеджерЗаписи.ГруппаИнвалидности ИЛИ
			ДатаВыдачиПриОткрытии <> РегистрСведенийМенеджерЗаписи.ДатаВыдачи ИЛИ
			ОтношениеКИнвалидностиПриОткрытии <> РегистрСведенийМенеджерЗаписи.ОтношениеКИнвалидности ИЛИ
			НомерСправкиПриОткрытии <> РегистрСведенийМенеджерЗаписи.НомерСправки ИЛИ
			СерияСправкиПриОткрытии <> РегистрСведенийМенеджерЗаписи.СерияСправки ИЛИ
			СрокДействияСправкиПриОткрытии <> РегистрСведенийМенеджерЗаписи.СрокДействияСправки Тогда
			Если ЗначениеЗаполнено(ОтношениеКИнвалидностиПриОткрытии) Тогда
				МенеджерЗаписи = РегистрыСведений.СведенияОбИнвалидностиФизлиц.СоздатьМенеджерЗаписи();
				МенеджерЗаписи.Период   = ПериодПриОткрытии;
				МенеджерЗаписи.ФизЛицо  = ФизЛицоПриОткрытии;
				МенеджерЗаписи.ГруппаИнвалидности	  = ГруппаИнвалидностиПриОткрытии;
				МенеджерЗаписи.ДатаВыдачи	     	  = ДатаВыдачиПриОткрытии;
				МенеджерЗаписи.ОтношениеКИнвалидности = ОтношениеКИнвалидностиПриОткрытии;
				МенеджерЗаписи.НомерСправки     	  = НомерСправкиПриОткрытии;
				МенеджерЗаписи.СерияСправки	     	  = СерияСправкиПриОткрытии;
				МенеджерЗаписи.СрокДействияСправки	  = СрокДействияСправкиПриОткрытии;
				МенеджерЗаписи.Записать();
			КонецЕсли;
		КонецЕсли; 
	КонецЕсли;
	ПериодПриОткрытии            	  = РегистрСведенийМенеджерЗаписи.Период;
	ГруппаИнвалидностиПриОткрытии	  = РегистрСведенийМенеджерЗаписи.ГруппаИнвалидности;
	ДатаВыдачиПриОткрытии 		   	  = РегистрСведенийМенеджерЗаписи.ДатаВыдачи;
	ОтношениеКИнвалидностиПриОткрытии = РегистрСведенийМенеджерЗаписи.ОтношениеКИнвалидности;
	НомерСправкиПриОткрытии		 	  = РегистрСведенийМенеджерЗаписи.НомерСправки;
	СерияСправкиПриОткрытии      	  = РегистрСведенийМенеджерЗаписи.СерияСправки;
	СрокДействияСправкиПриОткрытии	  = РегистрСведенийМенеджерЗаписи.СрокДействияСправки;


КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Период") Тогда	РегистрСведенийМенеджерЗаписи.Период = Параметры.Период; КонецЕсли;
	Если Параметры.Свойство("ДатаВыдачи") Тогда	РегистрСведенийМенеджерЗаписи.ДатаВыдачи = Параметры.ДатаВыдачи; КонецЕсли;
	Если Параметры.Свойство("ГруппаИнвалидности") Тогда	РегистрСведенийМенеджерЗаписи.ГруппаИнвалидности = Параметры.ГруппаИнвалидности; КонецЕсли;
	Если Параметры.Свойство("ОтношениеКИнвалидности") Тогда	РегистрСведенийМенеджерЗаписи.ОтношениеКИнвалидности = Параметры.ОтношениеКИнвалидности; КонецЕсли;
	Если Параметры.Свойство("НомерСправки") Тогда	РегистрСведенийМенеджерЗаписи.НомерСправки = Параметры.НомерСправки; КонецЕсли;
	Если Параметры.Свойство("СерияСправки") Тогда	РегистрСведенийМенеджерЗаписи.СерияСправки = Параметры.СерияСправки; КонецЕсли;
	Если Параметры.Свойство("СрокДействияСправки") Тогда	РегистрСведенийМенеджерЗаписи.СрокДействияСправки = Параметры.СрокДействияСправки; КонецЕсли;
	Если Параметры.Свойство("ФизЛицо") Тогда	РегистрСведенийМенеджерЗаписи.ФизЛицо = Параметры.ФизЛицо; КонецЕсли;
КонецПроцедуры
